// 给定一个整数数组，其中第 i 个元素代表了第 i 天的股票价格 。
//
// 设计一个算法计算出最大利润。在满足以下约束条件下，你可以尽可能地完成更多的交易（多次买卖一支股票）:
//
//
// 你不能同时参与多笔交易（你必须在再次购买前出售掉之前的股票）。
// 卖出股票后，你无法在第二天买入股票 (即冷冻期为 1 天)。
//
//
// 示例:
//
// 输入: [1,2,3,0,2]
// 输出: 3
// 解释: 对应的交易状态为: [买入, 卖出, 冷冻期, 买入, 卖出]
// Related Topics 动态规划
// 👍 568 👎 0

// leetcode submit region begin(Prohibit modification and deletion)
/**
 * @param {number[]} prices
 * @return {number}
 */
var maxProfit = function(prices) {
  const n = prices.length;
  if (!n) return 0;
  const dp = new Array(n + 1).fill(undefined).map(() => []);
  dp[0] = [-prices[0], 0, 0];
  for (let i = 1; i < n; i++) {
    // 0:当前已持有股票 1: 当前未持有股票，且在冷冻期 2:当天未持有股票，未在冷冻期
    dp[i][0] = Math.max(dp[i - 1][0], dp[i - 1][2] - prices[i]);
    dp[i][1] = dp[i - 1][0] + prices[i];
    dp[i][2] = Math.max(dp[i - 1][2], dp[i - 1][1]);
  }
  return Math.max(dp[n - 1][1], dp[n - 1][2]);
};
// leetcode submit region end(Prohibit modification and deletion)
